Repository: MustafaAdara/Inventory-Managment-Sol
Catalog: MOFA.StockManagement.Presentation.UI/Resources/SharedResource.*.resx
Languages: ar

# CompareAttribute_MustMatch
source: قيمة "{0}" و "{1}" غير متماثلتان EN
ar: قيمة "{0}" و "{1}" غير متماثلتان

# EmailAddressAttribute_Invalid
source: قيمة "{0}" ليست عنوان بريد الكترونى صحيح EN
ar: قيمة "{0}" ليست عنوان بريد الكترونى صحيح

# FieldMustBeDate
source: قيمة "{0}" يجب ان تكون تاريخ. EN
ar: قيمة "{0}" يجب ان تكون تاريخ.

# FieldMustBeNumeric
source: قيمة "{0}" يجب ان تكون رقم. EN
ar: قيمة "{0}" يجب ان تكون رقم.

# InvalidPropertyValue
source: قيمة '{0}' غير صحيحة. EN
ar: قيمة '{0}' غير صحيحة.

# Login_Invalid
source: اسم المستخدم أو كلمة السر غير صحيحة EN
ar: اسم المستخدم أو كلمة السر غير صحيحة

# Login_MailNotConfimed
source: لم يتم تأكيد بريدك الألكترونى رجاءً راجع بريدك او <a href="{0}">أعد ارسال بريد التاكيد</a> EN
ar: لم يتم تأكيد بريدك الألكترونى رجاءً راجع بريدك او <a href="{0}">أعد ارسال بريد التاكيد</a>

# MinLengthAttribute_ValidationError
source: قيمة "{0}" لابد ان تكون على الأقل "{1}" حروف EN
ar: قيمة "{0}" لابد ان تكون على الأقل "{1}" حروف

# ModelBinding_NonPropertyValueMustBeANumber
source: The field must be a number.
ar: قيمة لابد ان تكون رقمى

# ModelBinding_ValueMustBeANumber
source: The field {0} must be a number.
ar: قيمة {0} لابد ان تكون رقمى

# PasswordValidator_PasswordRequireDigit
source: The password must contain digits (0-9)
ar: كلمة السر يجب ان تحتوى رقم

# PasswordValidator_PasswordRequireLower
source: The password must contain lowercase letters ('a'-'z')
ar: كلمة السر يجب ان تحتوى حرف صغير

# PasswordValidator_PasswordRequireNonLetterOrDigit
source: The password must contain non alphanumeric character
ar: كلمة السر يجب ان تحتوى حرف مميز غير الحروف و الأرقام

# PasswordValidator_PasswordRequireUpper
source: The password must contain uppercase letters ('A'-'Z')
ar: كلمة السر يجب ان تحتوى حرف كبير

# PasswordValidator_PasswordTooShort
source: The password is too short
ar: كلمة السر اقل من المسموح

# PhoneAttribute_Invalid
source: قمية "{0}" ليست رقم هاتف صحيح EN
ar: قمية "{0}" ليست رقم هاتف صحيح

# PropertyValueInvalid
source: القيمة '{0}' غير ملائمة لـ "{1}". EN
ar: القيمة '{0}' غير ملائمة لـ "{1}".

# RegexAttribute_ValidationError
source: The field {0} must match the regular expression '{1}'.
ar: قيمة "{0}" غير مطابقة للشكل الصحيح '{1}'

# RequiredAttribute_ValidationError
source: The {0} field is required.
ar: قيمة "{0}" الزامية.

# StringLengthAttribute_ValidationError
source: The field {0} must be a string with a maximum length of {1}
ar: قيمة "{0}" لابد ان تكون على الأكتر "{1}" حروف

# StringLengthAttribute_ValidationErrorIncludingMinimum
source: The field {0} must be a string with a maximum length of {1} and a minimum length of {2}.
ar: قيمة "{0}" لابد ان تكون على الأقل "{2}" حروف و على الأكثر "{1}" حروف

# ValidateEmail_DuplicateEmail
source: البريد الالكترونى سبق ادخاله من قبل EN
ar: البريد الالكترونى سبق ادخاله من قبل

# ValidateEmail_InvalidEmail
source: البريد الالكترونى غير صحيح EN
ar: البريد الالكترونى غير صحيح

# ValidateEmail_PropertyTooShort
source: البريد الالكترونى اقل من المسموح EN
ar: البريد الالكترونى اقل من المسموح

# ValidateUserName_DuplicateName
source: اسم الدخول موجود من قبل EN
ar: اسم الدخول موجود من قبل

# ValidateUserName_InvalidUserName
source: اسم الدخول غير صحيح EN
ar: اسم الدخول غير صحيح

# ValidateUserName_PropertyTooShort
source: اسم الدخول اقل من المسموح EN
ar: اسم الدخول اقل من المسموح

# Validator_CompareAttribute
source: '{0}' and '{1}' do not match.
ar: قيمة {0} و {1} غير منطبقين

# Validator_CreditCardAttribute
source: The {0} field is not a valid credit card number.
ar: قيمة {0} غير مطابقة لبطاقة الآئتمان

# Validator_DataTypeAttribute_Currency
source: Please enter a valid date.
ar: ادخل قيمة صحيحة

# Validator_DataTypeAttribute_Date
source: Please enter a valid date.
ar: ادخل تاريخ صحيح

# Validator_EmailAddressAttribute
source: قيمة {0} غير مطابقة لبريد الكترونى EN
ar: قيمة {0} غير مطابقة لبريد الكترونى

# Validator_FileExtensionsAttribute
source: The {0} field only accepts files with the following extensions: {1}
ar: قيمة {0} تقبل فقط الأمتدادات : : {1}

# Validator_MaxLengthAttribute
source: The field {0} must be a string or array type with a maximum length of '{1}'.
ar: قيمة {0} لابد ان يكون الحد الأقصى '{1}'.

# Validator_MinLengthAttribute
source: The field {0} must be a string or array type with a minimum length of '{1}'.
ar: قيمة {0} لابد ان يكون الحد الأدنى'{1}'.

# Validator_PhoneAttribute
source: The {0} field is not a valid phone number.
ar: قيمة {0} غير مطابقة لرقم هاتف.

# Validator_RangeAttribute
source: The field {0} must be between {1} and {2}.
ar: قيمة {0} لابد تتراوح من {1} الى {2}.

# Validator_RegularExpressionAttribute
source: The field {0} must match the regular expression '{1}'.
ar: قيمة {0} لابد ان تطابق نمط '{1}'.

# Validator_RequiredAttribute
source: The {0} field is required.
ar: قيمة "{0}" الزامية.

# Validator_StringLengthAttribute
source: The field {0} must be a string with a maximum length of {1}.
ar: قيمة "{0}" لابد ان تكون على الأكتر "{1}" حروف

# Validator_StringLengthAttributeWithMin
source: The field {0} must be a string with a maximum length of {1} and a minimum length of {2}.
ar: طول قيمة {0} بحد ادنى {2} و بحد ادقصى {1}.

# Validator_UrlAttribute
source: The {0} field is not a valid fully-qualified http, https, or ftp URL.
ar: قيمة {0} غير منطبقة لعنوان ويب.

# Validator_ValueMustBeANumber
source: قيمة {0} لابد ان تطابق نمط رقمى EN
ar: قيمة {0} لابد ان تطابق نمط رقمى
